stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_ll_i2c.h
/**
  * @brief  Check if the SMBus Packet Error byte internal comparison is requested or not.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(I2Cx) can be used to check whether or not
  *         SMBus feature is supported by the I2Cx Instance.
  * @rmtoll CR2          PECBYTE       LL_I2C_IsEnabledSMBusPECCompare
  * @param  I2Cx I2C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledSMBusPECCompare(const I2C_TypeDef *I2Cx)
{
  return ((READ_BIT(I2Cx->CR2, I2C_CR2_PECBYTE) == (I2C_CR2_PECBYTE)) ? 1UL : 0UL);
}

/**
  * @brief  Get the SMBus Packet Error byte calculated.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(I2Cx) can be used to check whether or not
  *         SMBus feature is supported by the I2Cx Instance.
  * @rmtoll PECR         PEC           LL_I2C_GetSMBusPEC
  * @param  I2Cx I2C Instance.
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint32_t LL_I2C_GetSMBusPEC(const I2C_TypeDef *I2Cx)
{
  return (uint32_t)(READ_BIT(I2Cx->PECR, I2C_PECR_PEC));
}

/**
  * @brief  Read Receive Data register.
  * @rmtoll RXDR         RXDATA        LL_I2C_ReceiveData8
  * @param  I2Cx I2C Instance.
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint8_t LL_I2C_ReceiveData8(const I2C_TypeDef *I2Cx)
{
  return (uint8_t)(READ_BIT(I2Cx->RXDR, I2C_RXDR_RXDATA));
}

/**
  * @brief  Write in Transmit Data Register .
  * @rmtoll TXDR         TXDATA        LL_I2C_TransmitData8
  * @param  I2Cx I2C Instance.
  * @param  Data Value between Min_Data=0x00 and Max_Data=0xFF
  * @retval None
  */
__STATIC_INLINE void LL_I2C_TransmitData8(I2C_TypeDef *I2Cx, uint8_t Data)
{
  WRITE_REG(I2Cx->TXDR, Data);
}

/**
  * @}
  */

/** @defgroup I2C_LL_EF_AutonomousMode Configuration functions related to Autonomous mode feature
  * @{
  */

/**
  * @brief  Enable Selected Trigger
  * @rmtoll AUTOCR          TRIGEN          LL_I2C_Enable_SelectedTrigger
  * @param  I2Cx I2C Instance.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_Enable_SelectedTrigger(I2C_TypeDef *I2Cx)
{
  SET_BIT(I2Cx->AUTOCR, I2C_AUTOCR_TRIGEN);
}

/**
  * @brief  Disable Selected Trigger
  * @rmtoll AUTOCR          TRIGEN          LL_I2C_Disable_SelectedTrigger
  * @param  I2Cx I2C Instance.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_Disable_SelectedTrigger(I2C_TypeDef *I2Cx)
{
  CLEAR_BIT(I2Cx->AUTOCR, I2C_AUTOCR_TRIGEN);
}

/**
  * @brief  Indicate if selected Trigger is disabled or enabled
  * @rmtoll AUTOCR          TRIGEN          LL_I2C_IsEnabled_SelectedTrigger
  * @param  I2Cx I2C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabled_SelectedTrigger(const I2C_TypeDef *I2Cx)
{
  return ((READ_BIT(I2Cx->AUTOCR, I2C_AUTOCR_TRIGEN) == (I2C_AUTOCR_TRIGEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the trigger polarity
  * @rmtoll AUTOCR        TRIGPOL     LL_I2C_SetTriggerPolarity
  * @param  I2Cx I2C Instance.
  * @param  Polarity This parameter can be one of the following values:
  *         @arg @ref LL_I2C_TRIG_POLARITY_RISING
  *         @arg @ref LL_I2C_TRIG_POLARITY_FALLING
  * @retval None
  */
__STATIC_INLINE void LL_I2C_SetTriggerPolarity(I2C_TypeDef *I2Cx, uint32_t Polarity)
{
  MODIFY_REG(I2Cx->AUTOCR, I2C_AUTOCR_TRIGPOL, Polarity);
}

/**
  * @brief  Get the trigger polarity
  * @rmtoll AUTOCR        TRIGPOL     LL_I2C_GetTriggerPolarity
  * @param  I2Cx I2C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2C_TRIG_POLARITY_RISING
  *         @arg @ref LL_I2C_TRIG_POLARITY_FALLING
  */
__STATIC_INLINE uint32_t LL_I2C_GetTriggerPolarity(const I2C_TypeDef *I2Cx)
{
  return (uint32_t)(READ_BIT(I2Cx->AUTOCR, I2C_AUTOCR_TRIGPOL));
}

/**
  * @brief  Set the selected trigger
  * @rmtoll AUTOCR        TRIGSEL     LL_I2C_SetSelectedTrigger
  * @param  I2Cx I2C Instance.
  * @param  Trigger This parameter can be one of the following values:
  *         @arg @ref  LL_I2C_GRP1_GPDMA_CH0_TCF_TRG
  *         @arg @ref  LL_I2C_GRP1_GPDMA_CH1_TCF_TRG
  *         @arg @ref  LL_I2C_GRP1_GPDMA_CH2_TCF_TRG
  *         @arg @ref  LL_I2C_GRP1_GPDMA_CH3_TCF_TRG
  *         @arg @ref  LL_I2C_GRP1_EXTI5_TRG
  *         @arg @ref  LL_I2C_GRP1_EXTI9_TRG
  *         @arg @ref  LL_I2C_GRP1_LPTIM1_CH1_TRG
  *         @arg @ref  LL_I2C_GRP1_LPTIM2_CH1_TRG
  *         @arg @ref  LL_I2C_GRP1_COMP1_TRG
  *         @arg @ref  LL_I2C_GRP1_COMP2_TRG
  *         @arg @ref  LL_I2C_GRP1_RTC_ALRA_TRG
  *         @arg @ref  LL_I2C_GRP1_RTC_WUT_TRG
  *         @arg @ref  LL_I2C_GRP2_GPDMA_CH0_TCF_TRG
  *         @arg @ref  LL_I2C_GRP2_GPDMA_CH1_TCF_TRG
  *         @arg @ref  LL_I2C_GRP2_GPDMA_CH2_TCF_TRG
  *         @arg @ref  LL_I2C_GRP2_GPDMA_CH3_TCF_TRG
  *         @arg @ref  LL_I2C_GRP2_EXTI5_TRG
  *         @arg @ref  LL_I2C_GRP2_EXTI8_TRG
  *         @arg @ref  LL_I2C_GRP2_LPTIM1_CH1_TRG
  *         @arg @ref  LL_I2C_GRP2_COMP1_TRG
  *         @arg @ref  LL_I2C_GRP2_COMP2_TRG
  *         @arg @ref  LL_I2C_GRP2_RTC_ALRA_TRG
  *         @arg @ref  LL_I2C_GRP2_RTC_WUT_TRG
  * @retval None
  */
__STATIC_INLINE void LL_I2C_SetSelectedTrigger(I2C_TypeDef *I2Cx, uint32_t Trigger)
{
  MODIFY_REG(I2Cx->AUTOCR, I2C_AUTOCR_TRIGSEL, (Trigger & I2C_AUTOCR_TRIGSEL_Msk));
}

/**
  * @brief  Get the selected trigger
  * @rmtoll AUTOCR        TRIGSEL     LL_I2C_GetSelectedTrigger
  * @param  I2Cx I2C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref  LL_I2C_GRP1_GPDMA_CH0_TCF_TRG
  *         @arg @ref  LL_I2C_GRP1_GPDMA_CH1_TCF_TRG
  *         @arg @ref  LL_I2C_GRP1_GPDMA_CH2_TCF_TRG
  *         @arg @ref  LL_I2C_GRP1_GPDMA_CH3_TCF_TRG
  *         @arg @ref  LL_I2C_GRP1_EXTI5_TRG
  *         @arg @ref  LL_I2C_GRP1_EXTI9_TRG
  *         @arg @ref  LL_I2C_GRP1_LPTIM1_CH1_TRG
  *         @arg @ref  LL_I2C_GRP1_LPTIM2_CH1_TRG
  *         @arg @ref  LL_I2C_GRP1_COMP1_TRG
  *         @arg @ref  LL_I2C_GRP1_COMP2_TRG
  *         @arg @ref  LL_I2C_GRP1_RTC_ALRA_TRG
  *         @arg @ref  LL_I2C_GRP1_RTC_WUT_TRG
  *         @arg @ref  LL_I2C_GRP2_GPDMA_CH0_TCF_TRG
  *         @arg @ref  LL_I2C_GRP2_GPDMA_CH1_TCF_TRG
  *         @arg @ref  LL_I2C_GRP2_GPDMA_CH2_TCF_TRG
  *         @arg @ref  LL_I2C_GRP2_GPDMA_CH3_TCF_TRG
  *         @arg @ref  LL_I2C_GRP2_EXTI5_TRG
  *         @arg @ref  LL_I2C_GRP2_EXTI8_TRG
  *         @arg @ref  LL_I2C_GRP2_LPTIM1_CH1_TRG
  *         @arg @ref  LL_I2C_GRP2_COMP1_TRG
  *         @arg @ref  LL_I2C_GRP2_COMP2_TRG
  *         @arg @ref  LL_I2C_GRP2_RTC_ALRA_TRG
  *         @arg @ref  LL_I2C_GRP2_RTC_WUT_TRG
  */
__STATIC_INLINE uint32_t LL_I2C_GetSelectedTrigger(const I2C_TypeDef *I2Cx)
{
#if defined(LL_I2C_TRIG_GRP1)
  if (IS_LL_I2C_GRP2_INSTANCE(I2Cx))
  {
    return (uint32_t)((READ_BIT(I2Cx->AUTOCR, I2C_AUTOCR_TRIGSEL) | LL_I2C_TRIG_GRP2));
  }
  else
  {
    return (uint32_t)((READ_BIT(I2Cx->AUTOCR, I2C_AUTOCR_TRIGSEL) | LL_I2C_TRIG_GRP1));
  }
#else
  return (uint32_t)((READ_BIT(I2Cx->AUTOCR, I2C_AUTOCR_TRIGSEL) | LL_I2C_TRIG_GRP2));
#endif /* LL_I2C_TRIG_GRP1 */
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup I2C_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

ErrorStatus LL_I2C_Init(I2C_TypeDef *I2Cx, const LL_I2C_InitTypeDef *I2C_InitStruct);
ErrorStatus LL_I2C_DeInit(const I2C_TypeDef *I2Cx);
void LL_I2C_StructInit(LL_I2C_InitTypeDef *I2C_InitStruct);


/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* I2C1 || I2C3 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32WBAxx_LL_I2C_H */
